Autodesk.Revit.DB.IModelExportContextWithSolidProxy.OnSolidEnd(Autodesk.Revit.DB.SolidNode)
This method marks the end of the current Solid being exported.
node:
An output node that represents a Solid.
Since:
2021

Autodesk.Revit.DB.IModelExportContextWithSolidProxy.OnSolidBegin(Autodesk.Revit.DB.SolidNode)
This method is called when a Solid is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Solid.
Returns:
Return RenderNodeAction.Proceed if you wish to receive low-level geometry
(faces) for this Solid, or otherwise return RenderNodeAction.Skip.
Since:
2021